Revit 2026 API

# FamilyParameterFormula Property

---

The formula.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string Formula { get; }
```
```vb
Public ReadOnly Property Formula As String
	Get
```
```cpp
public:
property String^ Formula {
	String^ get ();
}
```
```fsharp
member Formula : string with get
```

#### Property Value

String

Returns  if there is no formula governing this parameter.

#### Reference

FamilyParameter Class

Autodesk.Revit.DB Namespace